{"@odata.context":"https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies/$entity","createdDateTime":"2023-11-22T07:25:06.6922608Z","creationSource":null,"description":"","lastModifiedDateTime":"2023-11-22T07:25:55.050055Z","name":"iOS - Managed Settings - Device - Recommendation Cadence - v2.0","platforms":"iOS","priorityMetaData":null,"roleScopeTagIds":["0"],"settingCount":1,"technologies":"mdm,appleRemoteManagement","id":"3091d0ff-0ef1-4446-bb1f-23459858b2f9","templateReference":{"templateId":"","templateFamily":"none","templateDisplayName":null,"templateDisplayVersion":null},"settings":[{"id":"0","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance","settingDefinitionId":"settings_item_softwareupdatesettings","settingInstanceTemplateReference":null,"groupSettingCollectionValue":[{"settingValueTemplateReference":null,"children":[{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"settings_item_softwareupdatesettings_recommendationcadence","settingInstanceTemplateReference":null,"choiceSettingValue":{"settingValueTemplateReference":null,"value":"settings_item_softwareupdatesettings_recommendationcadence_2","children":[]}}]}]}}]}